---
kind: property
id: P:Autodesk.Revit.DB.PerformanceAdviser.IsValidObject
source: html/d519284d-7e1c-341e-5bb3-465f78afb8bd.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.